class Тварина:
    def __init__(self, ім_я, вік):
        self.ім_я = ім_я
        self.вік = вік

    def їсти(self):
        print(f"{self.ім_я} їсть.")

    def спати(self):
        print(f"{self.ім_я} спить.")

    def інформація(self):
        print(f"Ім'я: {self.ім_я}, Вік: {self.вік} років")


class Собака(Тварина):
    def гавкати(self):
        print(f"{self.ім_я} гавкає: Гав-гав!")


class Кіт(Тварина):
    def нявкати(self):
        print(f"{self.ім_я} нявкає: Няв-няв!")


собака = Собака("Бобік", 3)
кіт = Кіт("Мурчик", 2)

собака.інформація()
собака.їсти()
собака.спати()
собака.гавкати()

print()

кіт.інформація()
кіт.їсти()
кіт.спати()
кіт.нявкати()
